// pages/classroom/classroom.js
import Toast from '../../miniprogram_npm/@vant/weapp/toast/toast.js';
import Dialog from '../../miniprogram_npm/@vant/weapp/dialog/dialog.js';
var app = getApp();
Page({

  /**
   * 页面的初始数据
   */
  data: {
    item: 0,
    tab: 0,
    value: '',
    classroom: ['文科楼101', '文科楼102', '文科楼103', '文科楼104', '文科楼105', '文科楼106', '文科楼107', '文科楼108', '文科楼201', '文科楼202', '文科楼203', '文科楼204', '文科楼205', '文科楼206', '文科楼207', '文科楼208', '文科楼301', '文科楼302', '文科楼30', '文科楼304', '文科楼305', '文科楼306', '文科楼307', '文科楼308', '文科楼401', '文科楼402', '文科楼403', '文科楼404', '文科楼405', '文科楼501', '文科楼502', '文科楼503', '文科楼504', '文科楼505', '文科楼505', '文科楼506'],
    classroom2: ['理科楼101', '理科楼102', '理科楼103', '理科楼104', '理科楼105', '理科楼106', '理科楼107', '理科楼108', '理科楼201', '理科楼202', '理科楼203', '理科楼204', '理科楼205', '理科楼206', '理科楼207', '理科楼208', '理科楼301', '理科楼302', '理科楼30', '理科楼304', '理科楼305', '理科楼306', '理科楼307', '理科楼308', '理科楼401', '理科楼402', '理科楼403', '理科楼404', '理科楼405', '理科楼501', '理科楼502', '理科楼503', '理科楼504', '理科楼505', '理科楼505', '理科楼506'],
    classroom3: ['信息楼101', '信息楼102', '信息楼103', '信息楼104', '信息楼105', '信息楼106', '信息楼107', '信息楼108', '信息楼201', '信息楼202', '信息楼203', '信息楼204', '信息楼205', '信息楼206', '信息楼207', '信息楼208', '信息楼301', '信息楼302', '信息楼30', '信息楼304', '信息楼305', '信息楼306', '信息楼307', '信息楼308', '信息楼401', '信息楼402', '信息楼403', '信息楼404', '信息楼405', '信息楼501', '信息楼502', '信息楼503', '信息楼504', '信息楼505', '信息楼505', '信息楼506'],
  },
  //页面切换
  changeItem: function (e) {
    this.setData({
      item: e.target.dataset.item,
    })

  },
  //tab 切换
  changeTab: function (e) {
    this.setData({
      tab: e.detail.current
    })
  },



  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    if (!app.globalData.LOGINED) {
      Dialog.alert({
        title: '未登录',
        message: '请先登录！'
      }).then(() => {
        wx.switchTab({
          url: '/pages/my/my',
        })
      });
     
    }else{
      wx.getSetting({
        withSubscriptions: true,
        success(e){
          console.log(e)
        }
      })
    }
      
  },

 
  onShow: function () {
    this.onLoad()
  },
})